tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
# CLI tool for Angular
brew "angular-cli"
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node@18"
# Development kit for the Java programming language
brew "openjdk"
# App to build and share containerized applications and microservices
cask "docker"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# LG monitor software
cask "lg-onscreen-control"
# TeX distribution
cask "mactex"
# Unpacks archive files
cask "the-unarchiver"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Desktop client for WhatsApp
cask "whatsapp"

# Applications from the Mac App Store
mas "AdBlock Pro", id: 1018301773
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
